Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_57 (Conv2D)           (None, 222, 222, 64)      1792      
_________________________________________________________________
batch_normalization_66 (Batc (None, 222, 222, 64)      256       
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 220, 220, 64)      36928     
_________________________________________________________________
batch_normalization_67 (Batc (None, 220, 220, 64)      256       
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 110, 110, 64)      0         
_________________________________________________________________
dropout_38 (Dropout)         (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 108, 108, 128)     73856     
_________________________________________________________________
batch_normalization_68 (Batc (None, 108, 108, 128)     512       
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 106, 106, 128)     147584    
_________________________________________________________________
batch_normalization_69 (Batc (None, 106, 106, 128)     512       
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 53, 53, 128)       0         
_________________________________________________________________
dropout_39 (Dropout)         (None, 53, 53, 128)       0         
_________________________________________________________________
conv2d_61 (Conv2D)           (None, 51, 51, 256)       295168    
_________________________________________________________________
batch_normalization_70 (Batc (None, 51, 51, 256)       1024      
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 49, 49, 256)       590080    
_________________________________________________________________
batch_normalization_71 (Batc (None, 49, 49, 256)       1024      
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 24, 24, 256)       0         
_________________________________________________________________
dropout_40 (Dropout)         (None, 24, 24, 256)       0         
_________________________________________________________________
conv2d_63 (Conv2D)           (None, 22, 22, 256)       590080    
_________________________________________________________________
conv2d_64 (Conv2D)           (None, 20, 20, 512)       1180160   
_________________________________________________________________
batch_normalization_72 (Batc (None, 20, 20, 512)       2048      
_________________________________________________________________
conv2d_65 (Conv2D)           (None, 18, 18, 256)       1179904   
_________________________________________________________________
batch_normalization_73 (Batc (None, 18, 18, 256)       1024      
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 9, 9, 256)         0         
_________________________________________________________________
dropout_41 (Dropout)         (None, 9, 9, 256)         0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 20736)             0         
_________________________________________________________________
dense_21 (Dense)             (None, 256)               5308672   
_________________________________________________________________
batch_normalization_74 (Batc (None, 256)               1024      
_________________________________________________________________
dropout_42 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_22 (Dense)             (None, 128)               32896     
_________________________________________________________________
batch_normalization_75 (Batc (None, 128)               512       
_________________________________________________________________
dropout_43 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_23 (Dense)             (None, 81)                10449     
=================================================================
Total params: 9,455,761
Trainable params: 9,451,665
Non-trainable params: 4,096
